In [1]:
import pandas as pd
import numpy as np

In [2]:
# Création d'un DataFrame avec 10 lignes et 5 colonnes
data = {'Nom': ['Alice', 'Bob', 'Charlie', 'David', 'Emma', 'Frank', 'Grace', 'Hank', 'Ivy', 'Jack'],
        'Âge': [25, 30, 35, 28, 22, 40, 32, 29, 26, 33],
        'Ville': ['Paris', 'New York', 'Londres', 'Paris', 'New York', 'Londres', 'Paris', 'New York', 'Londres', 'Paris'],
        'Salaire': [60000, 75000, 80000, 50000, 70000, 90000, 55000, 72000, 68000, 80000],
        'Score': [75, 85, 90, 80, 95, 88, 92, 78, 87, 94]}

df = pd.DataFrame(data)

In [3]:
df

       Nom  Âge     Ville  Salaire  Score
0    Alice   25     Paris    60000     75
1      Bob   30  New York    75000     85
2  Charlie   35   Londres    80000     90
3    David   28     Paris    50000     80
4     Emma   22  New York    70000     95
5    Frank   40   Londres    90000     88
6    Grace   32     Paris    55000     92
7     Hank   29  New York    72000     78
8      Ivy   26   Londres    68000     87
9     Jack   33     Paris    80000     94

## Slicing

In [5]:
df['Nom'][0]

'Alice'

In [6]:
df['Nom'][1]

'Bob'

In [8]:
#Selectionner les trois premieres lignes 
susbet1  = df[:3]
susbet1

       Nom  Âge     Ville  Salaire  Score
0    Alice   25     Paris    60000     75
1      Bob   30  New York    75000     85
2  Charlie   35   Londres    80000     90

In [11]:
#Selectionner les lignes 4 à 7
subset_2 = df[3:8]
subset_2

     Nom  Âge     Ville  Salaire  Score
3  David   28     Paris    50000     80
4   Emma   22  New York    70000     95
5  Frank   40   Londres    90000     88
6  Grace   32     Paris    55000     92
7   Hank   29  New York    72000     78

In [12]:
# Sélectionner les colonnes 'Nom' et 'Âge'
subset3 = df[['Nom', 'Âge']]
subset3

       Nom  Âge
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
4     Emma   22
5    Frank   40
6    Grace   32
7     Hank   29
8      Ivy   26
9     Jack   33

In [13]:
# Utiliser iloc pour sélectionner des lignes et colonnes par position
subset5 = df.iloc[1:4, 0:3]
subset5

       Nom  Âge     Ville
1      Bob   30  New York
2  Charlie   35   Londres
3    David   28     Paris

In [14]:
# Filtrer les lignes avec une condition
subset6 = df[df['Salaire'] > 70000]
subset6

       Nom  Âge     Ville  Salaire  Score
1      Bob   30  New York    75000     85
2  Charlie   35   Londres    80000     90
5    Frank   40   Londres    90000     88
7     Hank   29  New York    72000     78
9     Jack   33     Paris    80000     94

In [16]:
new_df = df.loc[0:4, 'Score'] = df.loc[0:4, 'Score'] + 5
new_df

0     85
1     95
2    100
3     90
4    105
Name: Score, dtype: int64

In [17]:
# Utiliser le slicing pour remplacer des valeurs dans une colonne
new_Age = df.loc[df['Âge'] > 30, 'Âge'] = 30
new_Age

30